In [21]:
# Customer table
import pandas as pd
path = r"C:\Users\Admin\Downloads\Customers.csv"
customer = pd.read_csv(path, encoding='latin1')
customer.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11/19/1965

In [22]:
customer.isnull().sum()

CustomerKey     0
Gender          0
Name            0
City            0
State Code     10
State           0
Zip Code        0
Country         0
Continent       0
Birthday        0
dtype: int64

In [23]:
customer[customer["State Code"].isnull()]

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
5304,729681,Female,Rossana Padovesi,Polvica,NaN,Napoli,80035,Italy,Europe,4/18/1981
5316,732289,Male,Indro Piccio,Varcaturo,NaN,Napoli,80014,Italy,Europe,2/24/1949
5372,742042,Male,Amaranto Loggia,Casaferro,NaN,Napoli,80034,Italy,Europe,3/14/1936
5377,742886,Female,Edmonda Capon,Terzigno,NaN,Napoli,80040,Italy,Europe,8/6/1963
5378,743343,Female,Ambra Sagese,Pomigliano D'Arco,NaN,Napoli,80038,Italy,Europe,1/5/1961
5485,759705,Male,Callisto Lo Duca,Casilli,NaN,Napoli,80047,Italy,Europe,8/28/1976
5525,765589,Male,Michelino Lucchesi,Pompei Scavi,NaN,Napoli,80045,Italy,Europe,11/13/1947
5531,766410,Male,Adelmio Beneventi,Licola,NaN,Napoli,80078,Italy,Europe,1/13/1940
5631,781667,Female,Ilda Manna,Napoli,NaN,Napoli,80134,Italy,Europe,5/8/1977
5695,789177,Male,Calogero Folliero,Mariglianella,NaN,Napoli,80030,Italy,Europe,3/3/2000

In [24]:
# I will replace the Statecode Napoli to NPL with the help of internet
customer['State Code'] = customer['State Code'].fillna('NPL')
customer.isnull().sum()

CustomerKey    0
Gender         0
Name           0
City           0
State Code     0
State          0
Zip Code       0
Country        0
Continent      0
Birthday       0
dtype: int64

In [25]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15266 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.2+ MB

In [27]:
# Now convert the datatype into python datatypes
customer['Birthday'] = pd.to_datetime(customer['Birthday'])

In [28]:
# add one column named as age
from datetime import datetime
today = datetime.today()
customer['age']=today.year-customer["Birthday"].dt.year

In [11]:
customer.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday,age
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03,85
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27,45
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,1947-05-26,77
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,1957-09-17,67
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,1965-11-19,59

In [29]:
# check duplicate values
customer.duplicated().sum()

0

In [30]:
customer['Zip Code'] = pd.to_numeric(customer['Zip Code'], errors='coerce')
customer['Zip Code'] = customer['Zip Code'].fillna(0).astype(int)
customer.info()
# Now all the columns are converted

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15266 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  int32
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  datetime64[ns]
 10  age          15266 non-null  int32
dtypes: datetime64[ns](1), int32(2), int64(1), object(7)
memory usage: 1.2+ MB

In [31]:
# convert my cleaned data into dataframe
customer=pd.DataFrame(customer)
customer.to_csv("customers_table",index=False)
customers=pd.read_csv("customers_table")

In [34]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15266 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  int64
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  datetime64[ns]
 10  age          15266 non-null  int64
dtypes: datetime64[ns](1), int64(3), object(7)
memory usage: 1.3+ MB

In [33]:
customers['Birthday'] = pd.to_datetime(customers['Birthday'])

In [35]:
# connect my_SQL Process
import pymysql
myconnection=pymysql.connect(host="127.0.0.1",user="root",passwd="Farvez@12345")
myconnection.cursor().execute("create database Data_Spark")

1

In [37]:
a = ",".join(f"`{i}` {j}"  # Enclose column names with backticks
             for i, j in zip(customers.columns, customers.dtypes)
             ).replace("object", "text").replace("int64", "int").replace("datetime64[ns]","date")
a = "id INT AUTO_INCREMENT PRIMARY KEY," + a

# Print the generated SQL statement
print(a)

# Execute the SQL query to create the table
myconnection.cursor().execute(f"CREATE TABLE Data_Spark.Customers_table ({a})")

id INT AUTO_INCREMENT PRIMARY KEY,`CustomerKey` int,`Gender` text,`Name` text,`City` text,`State Code` text,`State` text,`Zip Code` int,`Country` text,`Continent` text,`Birthday` date,`age` int

0

In [40]:
import pymysql

# Establish the database connection
myconnection = pymysql.connect(host="127.0.0.1", user="root", passwd="Farvez@12345", database="Data_Spark")

# Create a cursor object
cursor = myconnection.cursor()

# Define the insert query
insert_query = """
INSERT INTO Customers_table (`CustomerKey`, `Gender`, `Name`, `City`, `State Code`, `State`, `Zip Code`, `Country`, `Continent`, `Birthday`, `age`) 
VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
"""

# Iterate over the DataFrame and insert each row
for index, row in customers.iterrows():
     cursor.execute(insert_query, (row['CustomerKey'], row['Gender'], row['Name'], row['City'], row['State Code'], row['State'], 
                                   row['Zip Code'], row['Country'], row['Continent'], row['Birthday'], row['age']))
# Commit the transaction
myconnection.commit()

# Close the cursor and connection
cursor.close()
myconnection.close()

In [41]:
len(customers)

15266

In [95]:
# Sales Table
import pandas as pd
path=r"C:\Users\Admin\Downloads\Sales.csv"
Sales=pd.read_csv(path)
Sales.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD

In [98]:
Sales.columns

Index(['Order Number', 'Line Item', 'Order Date', 'CustomerKey', 'StoreKey',
       'ProductKey', 'Quantity', 'Currency Code'],
      dtype='object')

In [5]:
Sales.isnull().sum()

Order Number         0
Line Item            0
Order Date           0
Delivery Date    49719
CustomerKey          0
StoreKey             0
ProductKey           0
Quantity             0
Currency Code        0
dtype: int64

In [6]:
len(Sales)

62884

In [7]:
Sales.duplicated().sum()

0

In [96]:
Sales.drop(["Delivery Date"],axis=1,inplace=True)

In [9]:
Sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  object
 3   CustomerKey    62884 non-null  int64
 4   StoreKey       62884 non-null  int64
 5   ProductKey     62884 non-null  int64
 6   Quantity       62884 non-null  int64
 7   Currency Code  62884 non-null  object
dtypes: int64(6), object(2)
memory usage: 3.8+ MB

In [10]:
Sales['Order Date'] = pd.to_datetime(Sales['Order Date'])
Sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  datetime64[ns]
 3   CustomerKey    62884 non-null  int64
 4   StoreKey       62884 non-null  int64
 5   ProductKey     62884 non-null  int64
 6   Quantity       62884 non-null  int64
 7   Currency Code  62884 non-null  object
dtypes: datetime64[ns](1), int64(6), object(1)
memory usage: 3.8+ MB

In [11]:
# convert my cleaned data into dataframe
Sales=pd.DataFrame(Sales)
Sales.to_csv("sales_table",index=False)
Sales=pd.read_csv("sales_table")

In [76]:
Sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  datetime64[ns]
 3   CustomerKey    62884 non-null  int64
 4   StoreKey       62884 non-null  int64
 5   ProductKey     62884 non-null  int64
 6   Quantity       62884 non-null  int64
 7   Currency Code  62884 non-null  object
dtypes: datetime64[ns](1), int64(6), object(1)
memory usage: 3.8+ MB

In [70]:
exchange=r"C:\Users\Admin\Downloads\Exchange_Rates.csv"
exchange=pd.read_csv(exchange)
exchange.head()

       Date Currency  Exchange
0  1/1/2015      USD    1.0000
1  1/1/2015      CAD    1.1583
2  1/1/2015      AUD    1.2214
3  1/1/2015      EUR    0.8237
4  1/1/2015      GBP    0.6415

In [92]:
exchange['Date'] = pd.to_datetime(exchange['Date'])
exchange.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  datetime64[ns]
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 263.0+ KB

In [90]:
exchange=pd.DataFrame(exchange)
exchange.to_csv("exchange_table",index=False)
exchange=pd.read_csv("exchange_table")

In [93]:
exchange.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  datetime64[ns]
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 263.0+ KB

In [87]:
import pymysql
myconnection=pymysql.connect(host="127.0.0.1",user="root",passwd="Farvez@12345")
e = ",".join(f"`{i}` {j}"  # Enclose column names with backticks
             for i, j in zip(exchange.columns, exchange.dtypes)
             ).replace("float64", "int").replace("object", "text").replace("datetime64[ns]","date")
e = "id INT AUTO_INCREMENT PRIMARY KEY," + e

# Print the generated SQL statement
print(e)

# Execute the SQL query to create the table
myconnection.cursor().execute(f"CREATE TABLE Data_Spark.exchange_table ({e})")

id INT AUTO_INCREMENT PRIMARY KEY,`Date` date,`Currency` text,`Exchange` int

0

In [94]:
import pymysql

# Establish the database connection
myconnection = pymysql.connect(host="127.0.0.1", user="root", passwd="Farvez@12345", database="Data_Spark")

# Create a cursor object
cursor = myconnection.cursor()

# Define the insert query
insert_query = """
INSERT INTO exchange_table (`Date`, `Currency`, `Exchange`) 
VALUES (%s, %s, %s)
"""

# Iterate over the DataFrame and insert each row
for index, row in exchange.iterrows():
     cursor.execute(insert_query, (row['Date'], row['Currency'], row['Exchange']))
# Commit the transaction
myconnection.commit()

# Close the cursor and connection
cursor.close()
myconnection.close()

In [ ]:
result_df = pd.merge(orders_df, exchange_df, left_on='Currency Code', right_on='Currency', how='left')

In [79]:
import pymysql
myconnection=pymysql.connect(host="127.0.0.1",user="root",passwd="Farvez@12345")
b = ",".join(f"`{i}` {j}"  # Enclose column names with backticks
             for i, j in zip(Sales.columns, Sales.dtypes)
             ).replace("object", "text").replace("int64", "int").replace("datetime64[ns]","date")
b = "id INT AUTO_INCREMENT PRIMARY KEY," + b

# Print the generated SQL statement
print(b)

# Execute the SQL query to create the table
myconnection.cursor().execute(f"CREATE TABLE Data_Spark.sales_table ({b})")

id INT AUTO_INCREMENT PRIMARY KEY,`Order Number` int,`Line Item` int,`Order Date` date,`CustomerKey` int,`StoreKey` int,`ProductKey` int,`Quantity` int,`Currency Code` text

0

In [14]:
import pymysql

# Establish the database connection
myconnection = pymysql.connect(host="127.0.0.1", user="root", passwd="Farvez@12345", database="Data_Spark")

# Create a cursor object
cursor = myconnection.cursor()

# Define the insert query
insert_query = """
INSERT INTO Sales_table (`Order Number`, `Line Item`, `Order Date`, `CustomerKey`, `StoreKey`, `ProductKey`, `Quantity`, `Currency Code`) 
VALUES (%s, %s, %s, %s, %s, %s, %s, %s)
"""

# Iterate over the DataFrame and insert each row
for index, row in Sales.iterrows():
     cursor.execute(insert_query, (row['Order Number'], row['Line Item'], row['Order Date'], row['CustomerKey'], row['StoreKey'], row['ProductKey'], 
                                   row['Quantity'], row['Currency Code']))
# Commit the transaction
myconnection.commit()

# Close the cursor and connection
cursor.close()
myconnection.close()

In [16]:
# Product Table
Product=r"C:\Users\Admin\Downloads\Products.csv"
Product=pd.read_csv(Product)
Product.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio

In [17]:
Product.isnull().sum()

ProductKey        0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
dtype: int64

In [19]:
Product.duplicated().sum()

0

In [20]:
Product.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   object
 5   Unit Price USD  2517 non-null   object
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: int64(3), object(7)
memory usage: 196.8+ KB

In [23]:
Product['Unit Cost USD'] = Product['Unit Cost USD'].str.replace('$', '')
Product['Unit Price USD'] = Product['Unit Price USD'].str.replace('$', '')
Product['Unit Cost USD'] = Product['Unit Cost USD'].str.replace(',', '').str.strip().astype(float)
Product['Unit Price USD'] = Product['Unit Price USD'].str.replace(',', '').str.strip().astype(float)

In [26]:
Product.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,7.40,14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,11.00,21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,11.00,21.57,101,MP4&MP3,1,Audio

In [25]:
Product.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   float64
 5   Unit Price USD  2517 non-null   float64
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 196.8+ KB

In [27]:
# convert my cleaned data into dataframe
Product=pd.DataFrame(Product)
Product.to_csv("Product_table",index=False)
Product=pd.read_csv("Product_table")

In [28]:
Product.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   float64
 5   Unit Price USD  2517 non-null   float64
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 196.8+ KB

In [35]:
import pymysql
myconnection=pymysql.connect(host="127.0.0.1",user="root",passwd="Farvez@12345")
c = ",".join(f"`{i}` {j}"  # Enclose column names with backticks
             for i, j in zip(Product.columns, Product.dtypes)
             ).replace("object", "text").replace("int64", "int").replace("float64","int")
#c = "id INT AUTO_INCREMENT PRIMARY KEY," + c

# Print the generated SQL statement
print(c)

# Execute the SQL query to create the table
myconnection.cursor().execute(f"CREATE TABLE Data_Spark.Product_table ({c})")

`ProductKey` int,`Product Name` text,`Brand` text,`Color` text,`Unit Cost USD` int,`Unit Price USD` int,`SubcategoryKey` int,`Subcategory` text,`CategoryKey` int,`Category` text

0

In [36]:
import pymysql

# Establish the database connection
myconnection = pymysql.connect(host="127.0.0.1", user="root", passwd="Farvez@12345", database="Data_Spark")

# Create a cursor object
cursor = myconnection.cursor()

# Define the insert query
insert_query = """
INSERT INTO product_table (`ProductKey`, `Product Name`, `Brand`, `Color`, `Unit Cost USD`, `Unit Price USD`, `SubcategoryKey`, `Subcategory`, `CategoryKey`, `Category`) 
VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
"""

# Iterate over the DataFrame and insert each row
for index, row in Product.iterrows():
     cursor.execute(insert_query, (row['ProductKey'], row['Product Name'], row['Brand'], row['Color'], row['Unit Cost USD'], row['Unit Price USD'], 
                                   row['SubcategoryKey'], row['Subcategory'], row['CategoryKey'], row['Category']))
# Commit the transaction
myconnection.commit()

# Close the cursor and connection
cursor.close()
myconnection.close()

In [49]:
Store=r"C:\Users\Admin\Downloads\Stores.csv"
Store=pd.read_csv(Store)
Store.head()

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0   1/1/2008
1         2  Australia            Northern Territory          665.0  1/12/2008
2         3  Australia               South Australia         2000.0   1/7/2012
3         4  Australia                      Tasmania         2000.0   1/1/2010
4         5  Australia                      Victoria         2000.0  12/9/2015

In [50]:
Store.isnull().sum()

StoreKey         0
Country          0
State            0
Square Meters    1
Open Date        0
dtype: int64

In [51]:
print(Store[Store.isnull().any(axis=1)])

    StoreKey Country   State  Square Meters Open Date
66         0  Online  Online            NaN  1/1/2010

In [65]:
Store.drop(index=66,axis=1,inplace=True)

In [66]:
Store.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 66 entries, 0 to 65
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       66 non-null     int64
 1   Country        66 non-null     object
 2   State          66 non-null     object
 3   Square Meters  66 non-null     float64
 4   Open Date      66 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 2.7+ KB

In [58]:
Store['Open Date']=pd.to_datetime(Store['Open Date'])
Store['Square Meters']=Store['Square Meters'].astype(float)

In [55]:
Store.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  66 non-null     float64
 4   Open Date      67 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 2.7+ KB

In [67]:
Store=pd.DataFrame(Store)
Store.to_csv("Store_table",index=False)
Store=pd.read_csv("Store_table")

In [59]:
Store.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  66 non-null     float64
 4   Open Date      67 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 2.7+ KB

In [68]:
Store.isnull().sum()

StoreKey         0
Country          0
State            0
Square Meters    0
Open Date        0
dtype: int64

In [61]:
import pymysql
myconnection=pymysql.connect(host="127.0.0.1",user="root",passwd="Farvez@12345")
d = ",".join(f"`{i}` {j}"  # Enclose column names with backticks
             for i, j in zip(Store.columns, Store.dtypes)
             ).replace("object", "text").replace("int64", "int").replace("float64","int").replace("datetime64[ns]","date")
#c = "id INT AUTO_INCREMENT PRIMARY KEY," + c

# Print the generated SQL statement
print(d)

# Execute the SQL query to create the table
myconnection.cursor().execute(f"CREATE TABLE Data_Spark.store_table ({d})")

`StoreKey` int,`Country` text,`State` text,`Square Meters` int,`Open Date` date

0

In [69]:
import pymysql

# Establish the database connection
myconnection = pymysql.connect(host="127.0.0.1", user="root", passwd="Farvez@12345", database="Data_Spark")

# Create a cursor object
cursor = myconnection.cursor()

# Define the insert query
insert_query = """
INSERT INTO store_table (`StoreKey`, `Country`, `State`, `Square Meters`, `Open Date`) 
VALUES (%s, %s, %s, %s, %s)
"""

# Iterate over the DataFrame and insert each row
for index, row in Store.iterrows():
     cursor.execute(insert_query, (row['StoreKey'], row['Country'], row['State'], row['Square Meters'], row['Open Date']))
# Commit the transaction
myconnection.commit()

# Close the cursor and connection
cursor.close()
myconnection.close()